### Advanced SQL

In [1]:
import pandas as pd
%load_ext sql
%sql sqlite://

'Connected: None@None'

In [2]:
# For compatibility across multiple platforms
import os
IB = os.environ.get('INSTABASE_URI',None) is not None
open = ib.open if IB else open

In [3]:
# Load tables from CSV files
# Cities
with open('Cities.csv','r') as f:
    Cities = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Cities;
%sql persist Cities
# Countries
with open('Countries.csv','r') as f:
    Countries = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Countries;
%sql persist Countries
# Players
with open('Players.csv','r') as f:
    Players = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Players;
%sql persist Players
# Teams
with open('Teams.csv','r') as f:
    Teams = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Teams;
%sql persist Teams

Done.
Done.
Done.
Done.

'Persisted teams'

#### Look at sample of Cities and Countries tables

In [4]:
%%sql
select * from Cities limit 5

Done.

[('Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 ('Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 ('Abisko', 'Sweden', 63.35, 18.83, 0.2),
 ('Adana', 'Turkey', 36.99, 35.32, 18.67),
 ('Albacete', 'Spain', 39.0, -1.87, 12.62)]

In [5]:
%%sql
select * from Countries limit 5

Done.

[('Albania', 2.9, 'no', 'yes'),
 ('Andorra', 0.07, 'no', 'no'),
 ('Austria', 8.57, 'yes', 'no'),
 ('Belarus', 9.48, 'no', 'no'),
 ('Belgium', 11.37, 'yes', 'yes')]

### Duplicates, table variables

*Warm-up: Find all cities in the EU with temperature > 15*

In [6]:
%%sql
select city
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes' and temperature > 15

Done.

[('Algeciras',),
 ('Athens',),
 ('Badajoz',),
 ('Barcelona',),
 ('Bari',),
 ('Cartagena',),
 ('Catania',),
 ('Cosenza',),
 ('Granada',),
 ('Huelva',),
 ('Kalamata',),
 ('Lisbon',),
 ('Marbella',),
 ('Messina',),
 ('Palermo',),
 ('Patras',),
 ('Pescara',),
 ('Rome',),
 ('Trikala',),
 ('Valencia',)]

*Modify previous query to: (1) return country instead of city (2) remove duplicates (3) change to non-EU (4) use table variables*

In [7]:
%%sql
select DISTINCT Cities.country
from Cities, Countries
where Cities.country = Countries.country
and EU = 'no' and temperature > 15

Done.

[('Turkey',), ('Albania',)]

*Find all pairs of cities with the same longitude; return the city pairs and their (shared) longitude*

In [8]:
%%sql
select C1.city, C2.city, C1.longitude
from Cities C1, Cities C2
where C1.longitude = C2.longitude
and C1.city < C2.city

Done.

[('Burgos', 'Madrid', -3.68),
 ('Craiova', 'Hrodna', 23.83),
 ('Maastricht', 'Stavanger', 5.68)]

*Find all pairs of cities that are near each other, i.e., lat and lng are both less than 0.5 apart; return city pairs*

In [9]:
%%sql
select C1.city, C2.city
from Cities C1, Cities C2
where abs(C1.longitude - C2.longitude) < .5
and abs(C1.latitude - C2.latitude) < .5
and C1.city < C2.city

Done.

[('Adana', 'Tarsus'),
 ('Ancona', 'Sarajevo'),
 ('Basel', 'Freiburg'),
 ('Basel', 'Mulhouse'),
 ('Bergamo', 'Milan'),
 ('Cartagena', 'Murcia'),
 ('Heidelberg', 'Karlsruhe'),
 ('Horlivka', 'Makiyivka')]

### <font color = 'green'>Your Turn</font>

*Find all pairs of cities with the same temperature. Return the city pairs along with their shared temperature. What do you think about the data after seeing the answer?*

In [10]:
%%sql
select C1.city, C2.city, C1.temperature
from Cities C1, Cities C2
where C1.temperature = C2.temperature
and C1.city < C2.city

Done.

[('Andorra', 'Sarajevo', 9.6),
 ('Augsburg', 'Innsbruck', 4.54),
 ('Baia Mare', 'Debrecen', 8.87),
 ('Balti', 'Botosani', 8.23),
 ('Basel', 'Elblag', 6.68),
 ('Basel', 'Freiburg', 6.68),
 ('Basel', 'Mulhouse', 6.68),
 ('Basel', 'Zurich', 6.68),
 ('Bialystok', 'Hrodna', 6.07),
 ('Bonn', 'Maastricht', 8.63),
 ('Bratislava', 'Brugge', 9.65),
 ('Bratislava', 'Gyor', 9.65),
 ('Bratislava', 'Lille', 9.65),
 ('Brno', 'Vienna', 7.86),
 ('Brugge', 'Gyor', 9.65),
 ('Brugge', 'Lille', 9.65),
 ('Bucharest', 'Le Mans', 10.59),
 ('Bucharest', 'Ruse', 10.59),
 ('Bytom', 'Ostrava', 7.66),
 ('Chemnitz', 'Prague', 8.05),
 ('Chemnitz', 'Sivas', 8.05),
 ('Chisinau', 'Glasgow', 8.6),
 ('Craiova', 'Pleven', 10.51),
 ('Daugavpils', 'Vilnius', 5.38),
 ('Edinburgh', 'Kremenchuk', 7.43),
 ('Edirne', 'Stara Zagora', 10.9),
 ('Elblag', 'Freiburg', 6.68),
 ('Elblag', 'Mulhouse', 6.68),
 ('Elblag', 'Zurich', 6.68),
 ('Eskisehir', 'Montpellier', 11.11),
 ('Freiburg', 'Mulhouse', 6.68),
 ('Freiburg', 'Zurich', 6.68),
 ('Geneva', 'Grenoble', 8.4),
 ('Gyor', 'Lille', 9.65),
 ('Karlsruhe', 'Metz', 8.88),
 ('Koszalin', 'Odense', 7.73),
 ('Le Mans', 'Ruse', 10.59),
 ('Ljubljana', 'Rijeka', 9.27),
 ('Manisa', 'Rome', 15.1),
 ('Mulhouse', 'Zurich', 6.68),
 ('Nis', 'Skopje', 9.36),
 ('Novi Sad', 'Szeged', 10.34),
 ('Prague', 'Sivas', 8.05),
 ('Tarsus', 'Trieste', 11.21)]

### Subqueries in Where clause

*Find all countries in the Countries table with no city in the Cities table*

In [11]:
%%sql
select country
from Countries
where not exists (select city from Cities
                  where Cities.country = Countries.country)

Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

*Find countries in the EU that have a city with temperature > 15*

In [12]:
%%sql
select country
from Countries
where EU = 'yes'
and exists (select * from Cities
            where Cities.country = Countries.country
            and temperature > 15)

Done.

[('Greece',), ('Italy',), ('Portugal',), ('Spain',)]

*Find the westernmost city; return the city and longitude*

In [13]:
%%sql
select city, longitude
from Cities C1
where not exists (select * from Cities C2
                  where C2.longitude < C1.longitude)

Done.

[('Lisbon', -9.14)]

*Add easternmost to previous query*

In [14]:
%%sql
select city, longitude
from Cities C1
where not exists (select * from Cities C2
                  where C2.longitude > C1.longitude)

Done.

[('Siirt', 41.93)]

*Westernmost city query using = and min*

In [15]:
%%sql
select city, longitude
from Cities
where longitude = (select min(longitude) from Cities)

Done.

[('Lisbon', -9.14)]

*Find all cities whose temperature is more than 50% higher than the average; return the city, country, and temperature, ordered by descending temperature*

In [16]:
%%sql
select city, country, temperature
from Cities
where temperature > (select avg(temperature) * 1.5 from Cities)
order by temperature desc

Done.

[('Adana', 'Turkey', 18.67),
 ('Palermo', 'Italy', 17.9),
 ('Athens', 'Greece', 17.41),
 ('Algeciras', 'Spain', 17.38),
 ('Cartagena', 'Spain', 17.32),
 ('Kalamata', 'Greece', 17.3),
 ('Marbella', 'Spain', 17.19),
 ('Huelva', 'Spain', 17.09),
 ('Patras', 'Greece', 16.9),
 ('Cosenza', 'Italy', 16.6),
 ('Messina', 'Italy', 16.54),
 ('Granada', 'Spain', 16.33),
 ('Valencia', 'Spain', 16.02),
 ('Trikala', 'Greece', 16.0),
 ('Barcelona', 'Spain', 15.78),
 ('Badajoz', 'Spain', 15.61),
 ('Lisbon', 'Portugal', 15.52),
 ('Elbasan', 'Albania', 15.18),
 ('Bari', 'Italy', 15.15),
 ('Pescara', 'Italy', 15.13),
 ('Manisa', 'Turkey', 15.1),
 ('Rome', 'Italy', 15.1),
 ('Catania', 'Italy', 15.04),
 ('Denizli', 'Turkey', 15.02),
 ('Murcia', 'Spain', 15.0),
 ('Marseille', 'France', 14.98)]

*Number of cities in the EU*

In [17]:
%%sql
select count(*)
from Cities
where country in (select country from Countries where EU = 'yes')

Done.

[(150,)]

*Modify previous query to use "not in"*

In [18]:
%%sql
select count(*)
from Cities
where country not in (select country from Countries where EU = 'yes')

Done.

[(63,)]

*Same query using join instead of subquery*

In [19]:
%%sql
select count(*)
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes'

Done.

[(150,)]

*Number of countries having cities with temperature < 12*

In [20]:
%%sql
select count(*)
from Countries
where country in (select country from Cities where temperature < 12)

Done.

[(34,)]

*Same query using join instead of subquery*

In [21]:
%%sql
select count(DISTINCT c2.country)
from Cities c1, Countries c2
where c1.country = c2.country
and c1.temperature < 12

Done.

[(34,)]

*Find countries in Countries table with no city in Cities table using join instead of subquery (subquery version repeated first)*

In [22]:
%%sql
select country
from Countries
where not exists (select city from Cities
                  where Cities.country = Countries.country)

Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

In [23]:
%%sql
FILL IN

(sqlite3.OperationalError) near "FILL": syntax error [SQL: 'FILL IN']

### <font color = 'green'>Your Turn</font>

*Using "in" and a subquery in the Where clause, find all cities in a country whose population is < 2; return the city and country*

In [24]:
%%sql
select city, country
from Cities
where exists (select * from Countries
            where Cities.country = Countries.country
            and population < 2)

Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

*Write the same query using a join instead of a subquery*

In [25]:
%%sql
select C1.city, C2.country
from Cities C1, Countries C2
where C1.country = C2.country
and population < 2

Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

*Find all countries with no city having a temperature > 6*

In [26]:
%%sql
select country
from Countries
where exists (select * from Cities
            where Cities.country = Countries.country
            and temperature > 6)

Done.

[('Albania',),
 ('Andorra',),
 ('Austria',),
 ('Belarus',),
 ('Belgium',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Denmark',),
 ('France',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Ireland',),
 ('Italy',),
 ('Lithuania',),
 ('Macedonia',),
 ('Moldova',),
 ('Montenegro',),
 ('Netherlands',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Serbia',),
 ('Slovakia',),
 ('Slovenia',),
 ('Spain',),
 ('Sweden',),
 ('Switzerland',),
 ('Turkey',),
 ('Ukraine',),
 ('United Kingdom',)]

### Aggregation with Having clause

*Find all countries with average city temperature > 10; return country and average temperature*

In [27]:
%%sql
select country, avg(temperature)
from Cities
group by country
having avg(temperature) > 10

Done.

[('Albania', 15.18),
 ('Bulgaria', 10.44),
 ('Croatia', 10.865),
 ('France', 10.151111111111112),
 ('Greece', 16.9025),
 ('Italy', 13.474666666666668),
 ('Portugal', 14.469999999999999),
 ('Spain', 14.238333333333332),
 ('Turkey', 11.726666666666665)]

*Find all countries with more than 10 cities*

In [28]:
%%sql
select country
from Cities
group by country
having count(*) > 10

Done.

[('France',),
 ('Germany',),
 ('Italy',),
 ('Spain',),
 ('Turkey',),
 ('Ukraine',),
 ('United Kingdom',)]

*Same query without Having clause*

In [29]:
%%sql
select distinct country
from Cities C1
where 10 < (select count(*) from Cities C2
            where C1.country=C2.country)

Done.

[('United Kingdom',),
 ('Turkey',),
 ('Spain',),
 ('France',),
 ('Italy',),
 ('Germany',),
 ('Ukraine',)]

*Which combinations of EU versus non-EU and coastline versus no-coastline have a minimum population greater than 0.5?*

In [30]:
%%sql
select EU, coastline, min(population)
from Countries
group by EU, coastline
having min(population) > 0.5

Done.

[('yes', 'no', 0.58), ('yes', 'yes', 1.18)]

*Find all countries with average city temperature more than 50% higher than the overall average; return country and average temperature*

In [31]:
%%sql
select country, avg(temperature)
from Cities
group by country
having avg(temperature) > (select 1.5 * avg(temperature) from Cities)

Done.

[('Albania', 15.18), ('Greece', 16.9025), ('Portugal', 14.469999999999999)]

### <font color = 'green'>Your Turn</font>

*Find all countries whose average city longitude is lower than the overall average longitude, and whose average city latitude is higher than the overall average latitude. Return the countries. Note: Yes, you can use "and" in Having clauses!*

In [32]:
%%sql
select country
from Cities
group by country
having avg(latitude) > (select avg(latitude) from Cities) and avg(longitude) > (select avg(longitude) from Cities)

Done.

[('Belarus',),
 ('Czech Republic',),
 ('Estonia',),
 ('Finland',),
 ('Latvia',),
 ('Lithuania',),
 ('Poland',),
 ('Slovakia',),
 ('Sweden',),
 ('Ukraine',)]

### Subqueries in From and Select clauses

*Find all countries with both cold and warm cities -- at least one city with temperature < 9 and one city with temperature > 14*

In [33]:
%%sql
select DISTINCT C1.country
from Cities C1, Cities C2
where C1.country = C2.country
and C1.temperature < 9 and C2.temperature > 14

Done.

[('France',), ('Turkey',), ('Italy',)]

*Modify query to also return count of cold and warm cities*

In [34]:
# (select count(*) from Cities where country = C1.country and temperature < 9) as numcold,
# (select count(*) from Cities where country = C1.country and temperature > 14) as numwarm

*Same query using subquery in From clause instead of Select clause*

In [35]:
%%sql
select Cold.country, numcold, numwarm
from (select country, count(*) as numcold from Cities
      where temperature < 9 group by country) Cold,
     (select country, count(*) as numwarm from Cities
      where temperature > 14 group by country) Warm
where Cold.country = Warm.country

Done.

[('France', 5, 1), ('Italy', 1, 7), ('Turkey', 4, 5)]

### Data modification

*Increase all city temperatures by 10%*

In [36]:
%%sql
update Cities
set temperature = 1.1 * temperature

213 rows affected.

[]

In [37]:
%%sql
select avg(temperature) from Cities

Done.

[(10.447624413145537,)]

*Increase temperatures another 10% for cities in countries with coastline*

In [38]:
%%sql
update Cities
set temperature = 1.1 * temperature
where country in (select country from Countries
                  where coastline = 'yes')

182 rows affected.

[]

*Delete all cities in Turkey*

In [39]:
%%sql
delete from Cities
where country = 'Turkey'

24 rows affected.

[]

*Create a new table non-EU containing list of cities (with country) not in the EU*

In [40]:
%%sql
drop table if exists NonEU;
create table NonEU(city, country);
insert into NonEU
  select city, country from cities
  where country in (select country from Countries
                    where EU = 'no');
select * from NonEU

Done.
Done.
39 rows affected.
Done.

[('Andorra', 'Andorra'),
 ('Balti', 'Moldova'),
 ('Basel', 'Switzerland'),
 ('Belgrade', 'Serbia'),
 ('Bergen', 'Norway'),
 ('Bila Tserkva', 'Ukraine'),
 ('Bodo', 'Norway'),
 ('Brest', 'Belarus'),
 ('Cherkasy', 'Ukraine'),
 ('Chernihiv', 'Ukraine'),
 ('Chernivtsi', 'Ukraine'),
 ('Chisinau', 'Moldova'),
 ('Elbasan', 'Albania'),
 ('Geneva', 'Switzerland'),
 ('Horlivka', 'Ukraine'),
 ('Hrodna', 'Belarus'),
 ('Kherson', 'Ukraine'),
 ('Kiev', 'Ukraine'),
 ('Kremenchuk', 'Ukraine'),
 ('Kryvyy Rih', 'Ukraine'),
 ('Lvov', 'Ukraine'),
 ('Makiyivka', 'Ukraine'),
 ('Mazyr', 'Belarus'),
 ('Minsk', 'Belarus'),
 ('Nis', 'Serbia'),
 ('Novi Sad', 'Serbia'),
 ('Orsha', 'Belarus'),
 ('Oslo', 'Norway'),
 ('Pinsk', 'Belarus'),
 ('Podgorica', 'Montenegro'),
 ('Rivne', 'Ukraine'),
 ('Sarajevo', 'Bosnia and Herzegovina'),
 ('Skopje', 'Macedonia'),
 ('Stavanger', 'Norway'),
 ('Sumy', 'Ukraine'),
 ('Trondheim', 'Norway'),
 ('Yevpatoriya', 'Ukraine'),
 ('Zhytomyr', 'Ukraine'),
 ('Zurich', 'Switzerland')]

*Add your city*

In [41]:
%%sql
insert into NonEU values ('my-city','my-country');
select * from NonEU

1 rows affected.
Done.

[('Andorra', 'Andorra'),
 ('Balti', 'Moldova'),
 ('Basel', 'Switzerland'),
 ('Belgrade', 'Serbia'),
 ('Bergen', 'Norway'),
 ('Bila Tserkva', 'Ukraine'),
 ('Bodo', 'Norway'),
 ('Brest', 'Belarus'),
 ('Cherkasy', 'Ukraine'),
 ('Chernihiv', 'Ukraine'),
 ('Chernivtsi', 'Ukraine'),
 ('Chisinau', 'Moldova'),
 ('Elbasan', 'Albania'),
 ('Geneva', 'Switzerland'),
 ('Horlivka', 'Ukraine'),
 ('Hrodna', 'Belarus'),
 ('Kherson', 'Ukraine'),
 ('Kiev', 'Ukraine'),
 ('Kremenchuk', 'Ukraine'),
 ('Kryvyy Rih', 'Ukraine'),
 ('Lvov', 'Ukraine'),
 ('Makiyivka', 'Ukraine'),
 ('Mazyr', 'Belarus'),
 ('Minsk', 'Belarus'),
 ('Nis', 'Serbia'),
 ('Novi Sad', 'Serbia'),
 ('Orsha', 'Belarus'),
 ('Oslo', 'Norway'),
 ('Pinsk', 'Belarus'),
 ('Podgorica', 'Montenegro'),
 ('Rivne', 'Ukraine'),
 ('Sarajevo', 'Bosnia and Herzegovina'),
 ('Skopje', 'Macedonia'),
 ('Stavanger', 'Norway'),
 ('Sumy', 'Ukraine'),
 ('Trondheim', 'Norway'),
 ('Yevpatoriya', 'Ukraine'),
 ('Zhytomyr', 'Ukraine'),
 ('Zurich', 'Switzerland'),
 ('my-city', 'my-country')]

### <font color = 'green'>Your Turn - Advanced SQL on World Cup Data</font>

#### Look at sample of Players and Teams tables

In [42]:
%%sql
select * from Players limit 5

Done.

[('Abdoun', 'Algeria', 'midfielder', 16, 0, 6, 0, 0),
 ('Belhadj', 'Algeria', 'defender', 270, 1, 146, 8, 0),
 ('Boudebouz', 'Algeria', 'midfielder', 74, 3, 28, 1, 0),
 ('Bougherra', 'Algeria', 'defender', 270, 1, 89, 11, 0),
 ('Chaouchi', 'Algeria', 'goalkeeper', 90, 0, 17, 0, 2)]

In [43]:
%%sql
select * from Teams limit 5

Done.

[('Brazil', 1, 5, 3, 1, 1, 9, 4, 7, 2),
 ('Spain', 2, 6, 5, 0, 1, 7, 2, 3, 0),
 ('Portugal', 3, 4, 1, 2, 1, 7, 1, 8, 1),
 ('Netherlands', 4, 6, 6, 0, 0, 12, 5, 15, 0),
 ('Italy', 5, 3, 0, 2, 1, 4, 5, 5, 0)]

*1) Find all pairs of teams who have the same number of goalsFor as
each other and the same number of goalsAgainst as each other.
Return the teams and numbers of goalsFor and goalsAgainst.
Make sure to return each pair only once.*

In [44]:
%%sql
select C1.team, C2.team, C1.goalsFor, C1.goalsAgainst
from Teams C1, Teams C2
where C1.goalsFor = C2.goalsFor and C1.goalsAgainst = C2.goalsAgainst
and C1.team < C2.team

Done.

[('Italy', 'Mexico', 4, 5),
 ('England', 'Nigeria', 3, 5),
 ('England', 'South Africa', 3, 5),
 ('Chile', 'England', 3, 5),
 ('Chile', 'Nigeria', 3, 5),
 ('Chile', 'South Africa', 3, 5),
 ('Cameroon', 'Greece', 2, 5),
 ('Australia', 'Denmark', 3, 6),
 ('Nigeria', 'South Africa', 3, 5)]

*2) Find all teams with ranking <30 where no player made more than 150 passes. Return the team and ranking.*

In [45]:
%%sql
select DISTINCT C1.team, C2.ranking
from Players C1, Teams C2
where C1.team = C2.team
and C2.ranking < 30 and C1.passes > 150

Done.

[('Argentina', 7),
 ('Australia', 20),
 ('Brazil', 1),
 ('Cameroon', 19),
 ('Chile', 18),
 ('England', 8),
 ('Germany', 6),
 ('Greece', 13),
 ('Italy', 5),
 ('Ivory Coast', 27),
 ('Mexico', 17),
 ('Netherlands', 4),
 ('Portugal', 3),
 ('Serbia', 15),
 ('Slovenia', 25),
 ('Spain', 2),
 ('Uruguay', 16),
 ('USA', 14)]

*3) Which team has the highest ratio of goalsFor to goalsAgainst?*

In [46]:
%%sql
select team , max(goalsAgainst)
from Teams

Done.

[('North Korea', 12)]

In [47]:
%%sql
select team , max(goalsFor)
from Teams

Done.

[('Germany', 13)]

*4) Find all team-position pairs where the average number of passes made by players in that position on that team is greater than 150. Return the team-position pairs.*

In [48]:
%%sql
select team, position
from Players
group by team
having avg(passes) > 150

Done.

[('Netherlands', 'forward'), ('Spain', 'midfielder')]

*5) Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

In [49]:
%%sql
select team, avg(passes)
from Players
where position = 'defender'
group by team
having avg(passes) > 150

Done.

[('Brazil', 190.0),
 ('Germany', 189.83333333333334),
 ('Mexico', 152.14285714285714),
 ('Netherlands', 182.5),
 ('Spain', 213.0)]

*6) Which team has the highest average number of passes per minute played? Return the team and average passes per minute. Note: To force floating point division, multiply one operand by 1.0. Hints: (1) You can compute a team's average number of passes per minute played by dividing the total number of passes by the total number of minutes. (2) Consider using Limit.*

In [50]:
%%sql
select team,max(avg_passes)
from 
(
select team, avg(passes*1.0/minutes) as avg_passes
from Players
group by team
having max(passes*1.0/minutes)
)

Done.

[('Spain', 0.6452722798993414)]